# Exploring Titanic Data

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('data/titanic.csv')

- What was the survival rate overall?
- Which gender fared the worst? What was their survival rate?
- What was the survival rate for each Pclass?
- Did any reverends survive? How many?
- What is the survival rate for people whose Age is empty?
- What is the survival rate for each port of embarkation?
- What is the survival rate for children (under 12) in each Pclass?
- Did the captain of the ship survive? Is he on the list?
- Of all the people that died, who had the most expensive ticket? - How much did it cost?
- Does having family on the boat help or hurt your chances of survival?

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
#What was the survival rate overall? ==> 61.6%
titanic.Survived.value_counts()/titanic.shape[0]

0    0.616162
1    0.383838
Name: Survived, dtype: float64

In [10]:
#Which gender fared the worst? What was their survival rate?
titanic.groupby('Sex')['Survived'].mean()
#male ==> 18.8%

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [11]:
#What was the survival rate for each Pclass?
titanic.groupby('Pclass')['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [16]:
#seems not
reverend = titanic['Name'].str.contains('Rev')
titanic.loc[reverend][['Name', 'Survived']]

                                  Name  Survived
149  Byles, Rev. Thomas Roussel Davids         0
150         Bateman, Rev. Robert James         0
249      Carter, Rev. Ernest Courtenay         0
626     Kirkland, Rev. Charles Leonard         0
848                  Harper, Rev. John         0
886              Montvila, Rev. Juozas         0

In [17]:
#What is the survival rate for people whose Age is empty?
titanic.loc[titanic['Age'].isnull()]['Survived'].mean()

0.2937853107344633

In [18]:
#What is the survival rate for each port of embarkation?
titanic.groupby('Embarked')['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

In [23]:
#What is the survival rate for children 
#(under 12) in each Pclass?
titanic.loc[titanic['Age'] < 12].groupby('Pclass')['Survived'].mean()

Pclass
1    0.750000
2    1.000000
3    0.404255
Name: Survived, dtype: float64

In [27]:
#Did the captain of the ship survive? Is he on the list?
titanic.loc[titanic.Name.str.contains('Capt')][['Name', 'Survived']]

                             Name  Survived
745  Crosby, Capt. Edward Gifford         0

In [31]:
#Of all the people that died, who had the most expensive ticket? - How much did it cost?
titanic.loc[titanic['Survived'] == 0][['Name', 'Fare']].nlargest(1, 'Fare')

                              Name   Fare
27  Fortune, Mr. Charles Alexander  263.0

In [38]:
#Does having family on the boat 
#help or hurt your chances of survival?
titanic.groupby(titanic['SibSp']>0)['Survived'].mean()

SibSp
False    0.345395
True     0.466431
Name: Survived, dtype: float64